Tekla Open API Reference for Tekla Structures 2025
ReferenceModel.UseWorkplane Property
Sets whether workplane is used.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool UseWorkplane { set; }
Public WriteOnly Property UseWorkplane As Boolean
	Set
Property Value
Type: Boolean
Remarks
Used only for insertsion!
See Also
Reference
ReferenceModel Class
Tekla.Structures.Model Namespace